IDENTIFICATION DIVISION.
PROGRAM-ID. ADDITION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  NUM1   PIC 9 VALUE 1.
01  NUM2   PIC 9 VALUE 1.
01  RESULT PIC 9.
PROCEDURE DIVISION.
    ADD NUM1 TO NUM2 GIVING RESULT.
    DISPLAY RESULT.
    STOP RUN.
